Pandas - DataFrame and Series

In [2]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\deepak18\appdata\roaming\python\python313\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\deepak18\appdata\roaming\python\python313\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\deepak18\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\deepak18\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\deepak18\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\deepak18\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#create a series from dict element

data={'a':1,'b':2,'c':3}

seris_dict=pd.Series(data)

print(seris_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [9]:
#Dataframe
#create a dataframe from dictioanry of list

data={
    'Name':['Deepak','Deep','Dev'],
    'Age':[25,30,35],
    'City':['A','B','C']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age City
0  Deepak   25    A
1    Deep   30    B
2     Dev   35    C
<class 'pandas.core.frame.DataFrame'>

In [10]:
import numpy as np
np.array(df)

array([['Deepak', 25, 'A'],
       ['Deep', 30, 'B'],
       ['Dev', 35, 'C']], dtype=object)

In [11]:
##Create a dataframe from list of dictioanries

data=[
    {'Name':'Deepak','Age': 30, 'City':'A'},
    {'Name':'Deep','Age': 35, 'City':'B'},
    {'Name':'Dev','Age': 40, 'City':'C'}
]

df1=pd.DataFrame(data)
print(df1)

     Name  Age City
0  Deepak   30    A
1    Deep   35    B
2     Dev   40    C

In [14]:
df2=pd.read_csv('placement.csv')
df2.head(5)

   cgpa  placement_exam_marks  placed
0  7.19                  26.0       1
1  7.46                  38.0       1
2  7.54                  40.0       1
3  6.42                   8.0       1
4  7.23                  17.0       0

In [15]:
df2.tail(5)

     cgpa  placement_exam_marks  placed
995  8.87                  44.0       1
996  9.12                  65.0       1
997  4.89                  34.0       0
998  8.62                  46.0       1
999  4.90                  10.0       1

In [17]:
#Accessing data from DataFrame
df2

     cgpa  placement_exam_marks  placed
0    7.19                  26.0       1
1    7.46                  38.0       1
2    7.54                  40.0       1
3    6.42                   8.0       1
4    7.23                  17.0       0
..    ...                   ...     ...
995  8.87                  44.0       1
996  9.12                  65.0       1
997  4.89                  34.0       0
998  8.62                  46.0       1
999  4.90                  10.0       1

[1000 rows x 3 columns]

In [18]:
df2.cgpa

0      7.19
1      7.46
2      7.54
3      6.42
4      7.23
       ...
995    8.87
996    9.12
997    4.89
998    8.62
999    4.90
Name: cgpa, Length: 1000, dtype: float64

In [20]:
#Accessing a specified element

df2['cgpa']

0      7.19
1      7.46
2      7.54
3      6.42
4      7.23
       ...
995    8.87
996    9.12
997    4.89
998    8.62
999    4.90
Name: cgpa, Length: 1000, dtype: float64

In [21]:
df2.at[2,'cgpa']

np.float64(7.54)

In [22]:
df3=pd.read_csv('titanic.csv')
df3.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
#data manipulation

df

     Name  Age City
0  Deepak   25    A
1    Deep   30    B
2     Dev   35    C

In [ ]:
#adding coloumn

df['salary']=[100000,200000,300000]
df

     Name  Age City  salary
0  Deepak   25    A  100000
1    Deep   30    B  200000
2     Dev   35    C  300000

In [28]:
#remove a coloumn

df.drop('salary', axis=1, inplace=True)
df

     Name  Age City
0  Deepak   25    A
1    Deep   30    B
2     Dev   35    C

In [29]:
#Add age to coloumn

df['Age'] = df['Age']+1
df

     Name  Age City
0  Deepak   26    A
1    Deep   31    B
2     Dev   36    C